In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
# Reading the three different csv files:
data_math = pd.read_csv('MathScoreTerm1.csv')
data_physics = pd.read_csv('PhysicsScoreTerm1.csv')
data_DSS = pd.read_csv('DSScoreTerm1.csv')

In [3]:
data_math.head()

             Name  Score  Age         Ethinicity Subject Sex  ID
0  AI-KYUNG CHUNG   88.0   18     White American   Maths   M   1
1     ALAN HARVEY   85.0   19  European American   Maths   M   2
2    ALAN REYNAUD   45.0   19  European American   Maths   M   3
3  ALBERT CENDANA   82.0   18     White American   Maths   M   4
4  ALBERT HOLT JR   82.0   18     White American   Maths   F   5

In [4]:
data_physics.head()

             Name  Score  Age         Ethinicity  Subject Sex  ID
0  AI-KYUNG CHUNG   84.0   18     White American  Physics   M   1
1     ALAN HARVEY   81.0   19  European American  Physics   M   2
2    ALAN REYNAUD   41.0   19  European American  Physics   M   3
3  ALBERT CENDANA   78.0   18     White American  Physics   M   4
4  ALBERT HOLT JR   78.0   18     White American  Physics   F   5

In [5]:
data_DSS.head()

             Name  Score  Age         Ethinicity        Subject Sex  ID
0  AI-KYUNG CHUNG   82.0   18     White American  Data Structue   M   1
1     ALAN HARVEY   79.0   19  European American  Data Structue   M   2
2    ALAN REYNAUD   39.0   19  European American  Data Structue   M   3
3  ALBERT CENDANA   76.0   18     White American  Data Structue   M   4
4  ALBERT HOLT JR   76.0   18     White American  Data Structue   F   5

In [6]:
print(data_DSS.shape)
print(data_math.shape)
print(data_physics.shape)

(599, 7)
(599, 7)
(599, 7)

In [7]:
data_DSS.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
Name          599 non-null object
Score         591 non-null float64
Age           599 non-null int64
Ethinicity    599 non-null object
Subject       599 non-null object
Sex           599 non-null object
ID            599 non-null int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.8+ KB

In [8]:
data_math.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
Name          599 non-null object
Score         596 non-null float64
Age           599 non-null int64
Ethinicity    599 non-null object
Subject       599 non-null object
Sex           599 non-null object
ID            599 non-null int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.8+ KB

In [9]:
data_physics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 599 entries, 0 to 598
Data columns (total 7 columns):
Name          599 non-null object
Score         593 non-null float64
Age           599 non-null int64
Ethinicity    599 non-null object
Subject       599 non-null object
Sex           599 non-null object
ID            599 non-null int64
dtypes: float64(1), int64(2), object(4)
memory usage: 32.8+ KB

In [11]:
data_DSS = data_DSS.drop(['Name','Ethinicity'],axis=1)
data_math = data_math.drop(['Name','Ethinicity'],axis=1)
data_physics = data_physics.drop(['Name','Ethinicity'],axis=1)

In [12]:
data_DSS.head()

   Score  Age        Subject Sex  ID
0   82.0   18  Data Structue   M   1
1   79.0   19  Data Structue   M   2
2   39.0   19  Data Structue   M   3
3   76.0   18  Data Structue   M   4
4   76.0   18  Data Structue   F   5

In [13]:
data_math.head()

   Score  Age Subject Sex  ID
0   88.0   18   Maths   M   1
1   85.0   19   Maths   M   2
2   45.0   19   Maths   M   3
3   82.0   18   Maths   M   4
4   82.0   18   Maths   F   5

In [14]:
data_physics.head()

   Score  Age  Subject Sex  ID
0   84.0   18  Physics   M   1
1   81.0   19  Physics   M   2
2   41.0   19  Physics   M   3
3   78.0   18  Physics   M   4
4   78.0   18  Physics   F   5

In [20]:
# Filling the missing values with zero

In [17]:
data_DSS = data_DSS.fillna(value=0)
data_physics = data_physics.fillna(value=0)
data_math = data_math.fillna(value=0)

In [19]:
print(data_DSS.isnull().sum())
print(data_math.isnull().sum())
print(data_physics.isnull().sum())

Score      0
Age        0
Subject    0
Sex        0
ID         0
dtype: int64
Score      3
Age        0
Subject    0
Sex        0
ID         0
dtype: int64
Score      6
Age        0
Subject    0
Sex        0
ID         0
dtype: int64

In [21]:
# Merge three files:

In [24]:
Data = pd.concat([data_DSS,data_math,data_physics])

In [25]:
Data.shape

(1797, 5)

In [27]:
# Label encode Sex column:

In [28]:
encode ={'Sex': {'M':1,
                'F':2}}

In [29]:
Data = Data.replace(encode)

In [30]:
Data.head()

   Score  Age        Subject  Sex  ID
0   82.0   18  Data Structue    1   1
1   79.0   19  Data Structue    1   2
2   39.0   19  Data Structue    1   3
3   76.0   18  Data Structue    1   4
4   76.0   18  Data Structue    2   5

In [31]:
Data['Sex'].value_counts()

1    1440
2     357
Name: Sex, dtype: int64

### 6. Store the data in new file – ScoreFinal.csv

In [32]:
Data.to_csv('ScoreFinal.csv')